disk91/stm32-it-sdk/Src/drivers/sigfox/sx126x_hal.c
/* ==========================================================
 * sx126x_hal.c - implementation for sigfox library, board api
 * ----------------------------------------------------------
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU LESSER General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Lesser Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 * ---------------------------------------------------------
 *
 *  Created on: 11 june 2024
 *      Author: Paul Pinault
 * ----------------------------------------------------------
 * Copyright : Paul Pinault aka Disk91 2024
 * ==========================================================
 */
#include <it_sdk/config.h>
#if ITSDK_WITH_SIGFOX_LIB == __ENABLE && ITSDK_SIGFOX_LIB == __SIGFOX_SX126X

#include <drivers/sx126x/sigfox_sx126x.h>
#ifdef USE_SIGFOX_EP_FLAGS_H
  #include "sigfox_ep_flags.h" // 3rdParties/sigfox/sigfox-ep-lib/inc/sigfox_ep_flags.h
#endif
#include "sx126x_hal.h"
#include "sigfox_types.h"
#include "board/sx126x_hw_api.h"
#include "sigfox_error.h"
#include "sx126x.h"

#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0
  #include "stm32wlxx_hal_subghz.h"
  HAL_StatusTypeDef SUBGHZSPI_Transmit(SUBGHZ_HandleTypeDef *hsubghz, uint8_t Data);
  HAL_StatusTypeDef SUBGHZSPI_Receive(SUBGHZ_HandleTypeDef *hsubghz, uint8_t *pData);
  HAL_StatusTypeDef SUBGHZ_WaitOnBusy(SUBGHZ_HandleTypeDef *hsubghz);
  HAL_StatusTypeDef SUBGHZ_CheckDeviceReady(SUBGHZ_HandleTypeDef *hsubghz);
#endif

// ----------------------------------------------------------------------
// HELPERS
// ----------------------------------------------------------------------
#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) == 0
void __sx126x_spi_nss_select() {
	#if ITSDK_SFX_SX126X_CS_PIN != __LP_GPIO_NONE
		gpio_set(ITSDK_SFX_SX126X_CS_BANK,ITSDK_SFX_SX126X_CS_PIN);
	#elif ITSDK_SFX_SX126X_CSDN_PIN != __LP_GPIO_NONE
		gpio_reset(ITSDK_SFX_SX126X_CSDN_BANK,ITSDK_SFX_SX126X_CSDN_PIN);
	#else
		#warning "You did not setup a CS pin for SX1262 SPI, are you sure ?"
	#endif
}

void __sx126x_spi_nss_unselect() {
	#if ITSDK_SFX_SX126X_CS_PIN != __LP_GPIO_NONE
		gpio_reset(ITSDK_SFX_SX126X_CS_BANK,ITSDK_SFX_SX126X_CS_PIN);
	#elif ITSDK_SFX_SX126X_CSDN_PIN != __LP_GPIO_NONE
		gpio_set(ITSDK_SFX_SX126X_CSDN_BANK,ITSDK_SFX_SX126X_CSDN_PIN);
	#else
		#warning "You did not setup a CS pin for SX1262 SPI, are you sure ?"
	#endif
}
#endif


// ============================================================
// Override the IRQ handlers
// As Subghz driver already decode and split the different
// interruption we need to regroup them for the sigfox handler
// this avoid to modify the global irq handler and makes integration
// easier
// ============================================================

#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

// the SX126X_RF_API_process callback function is bypassed as the subghz handler already
// split / clear and route the irq to the dedicated handler.
// the other way is to remove the hal sughz handler but it will be override by the cube mx
// regeneration and more complex to explain. Make sure this function is updated if SX126X_RF_API_process callback
// is updated in the future


// Approach #2 - should work
// Override the sx126x_get_and_clear_irq_status to fake the sx registers and return the right status
// function of the previous IRQ handler seen, so internal process function may work normally
// You need to add a function in the sx126x_rf_api.c file
//
//  __attribute__((weak)) sx126x_status_t SX126X_RF_API_get_and_clear_irq_status( const void* context, sx126x_irq_mask_t* irq ) {
// 	  return sx126x_get_and_clear_irq_status(context,irq);
//  }
//
// then replace the call to sx126x_get_and_clear_irq_status to SX126X_RF_API_get_and_clear_irq_status in this file
//
//  ...
//  sx126x_ctx.irq_flag = 0;
//  sx126x_status = SX126X_RF_API_get_and_clear_irq_status( SFX_NULL, &sx126x_irq_mask );
//   if (sx126x_status != SX126X_STATUS_OK)
//      EXIT_ERROR((RF_API_status_t) SX126X_RF_API_ERROR_CHIP_IRQ);
//

#define __SX126X_IRQ_CLEARED    0
#define __SX126X_IRQ_TXCOMPLETE	1
#define __SX126X_IRQ_RXCOMPLETE 2
static volatile uint8_t __sx126x_irq_status;
static SX126X_HW_irq_cb_t * __sx1262_irq_cb = NULL;
sx126x_status_t SX126X_RF_API_get_and_clear_irq_status( const void* context, sx126x_irq_mask_t* irq ) {

	itsdk_enterCriticalSection();
	// override the default function
	*irq = SX126X_IRQ_NONE;
	if ( __sx126x_irq_status & __SX126X_IRQ_TXCOMPLETE ) *irq |= SX126X_IRQ_TX_DONE;
	if ( __sx126x_irq_status & __SX126X_IRQ_RXCOMPLETE ) *irq |= SX126X_IRQ_RX_DONE;
	__sx126x_irq_status = __SX126X_IRQ_CLEARED;
	itsdk_leaveCriticalSection();

	#if (ITSDK_LOGGER_MODULE & __LOG_MOD_LOWSIGFOX) > 0
		if ( *irq != 0 ) LOG_DEBUG_SFXSX126X(("[SX] SX126X_RF_API_get_and_clear_irq_status\r\n"));
	#endif

	#if (defined CONTROL_KEEP_ALIVE_MESSAGE) || (defined BIDIRECTIONAL)
		// update the Vdd level during TX phase (right after)
		if ( *irq & SX126X_IRQ_TX_DONE ) sx126x_updateTxVoltate();
	#endif

	return SX126X_STATUS_OK;
}


void HAL_SUBGHZ_TxCpltCallback(SUBGHZ_HandleTypeDef *hsubghz) {
	LOG_DEBUG_SFXSX126X(("[SX] HAL_SUBGHZ_TxCpltCallback (0x%lX)\r\n",__sx1262_irq_cb));
	__sx126x_irq_status |= __SX126X_IRQ_TXCOMPLETE;
	if ( __sx1262_irq_cb != NULL ) __sx1262_irq_cb();
}

#ifdef BIDIRECTIONAL

 void HAL_SUBGHZ_RxCpltCallback(SUBGHZ_HandleTypeDef *hsubghz) {
	LOG_DEBUG_SFXSX126X(("[SX] HAL_SUBGHZ_RxCpltCallback (0x%lX)\r\n",__sx1262_irq_cb));
	__sx126x_irq_status |= __SX126X_IRQ_RXCOMPLETE;
	if ( __sx1262_irq_cb != NULL ) __sx1262_irq_cb();
 }

#endif	// BIDIRECTIONAL

