disk91/stm32-it-sdk/Src/drivers/sigfox/sx126x_hal.c
// Unused irq handlers
// void HAL_SUBGHZ_PreambleDetectedCallback(SUBGHZ_HandleTypeDef *hsubghz){}
// void HAL_SUBGHZ_SyncWordValidCallback(SUBGHZ_HandleTypeDef *hsubghz) {}
// void HAL_SUBGHZ_HeaderValidCallback(SUBGHZ_HandleTypeDef *hsubghz) {}
// void HAL_SUBGHZ_HeaderErrorCallback(SUBGHZ_HandleTypeDef *hsubghz) {}
// void HAL_SUBGHZ_CRCErrorCallback(SUBGHZ_HandleTypeDef *hsubghz){}
// void HAL_SUBGHZ_CADStatusCallback(SUBGHZ_HandleTypeDef *hsubghz,HAL_SUBGHZ_CadStatusTypeDef cadstatus){}
// void HAL_SUBGHZ_RxTxTimeoutCallback(SUBGHZ_HandleTypeDef *hsubghz){}
// void HAL_SUBGHZ_LrFhssHopCallback(SUBGHZ_HandleTypeDef *hsubghz) {}
// void HAL_SUBGHZ_RxTxTimeoutCallback(SUBGHZ_HandleTypeDef *hsubghz)
#else
  // integration with external irq
  static gpio_irq_chain_t __sx1262_irq;
#endif // (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

// ============================================================
// sx126x_eplib_api.c
// ============================================================


// ----------------------------------------------------------------------
// This function is called to reconfigure the board after a wake-up event
// The hal_wakeup is called right after, don't duplicate actions
// The context parameter is SFX_NULL
// Concretly this function is call on every send message
// ----------------------------------------------------------------------
sx126x_hal_status_t sx126x_hal_reset( const void* context )
{
    SFX_UNUSED(context);
    LOG_DEBUG_SFXSX126X(("[SX] sx126x_hal_reset\r\n"));

	#ifdef ERROR_CODES
	 SX126X_HW_API_status_t status = SX126X_HAL_STATUS_OK;
	#endif

	// Configure the pin for Chip Select
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) == 0
		#if ITSDK_SFX_SX126X_CS_PIN != __LP_GPIO_NONE
	     gpio_configure(ITSDK_SFX_SX126X_CS_BANK, ITSDK_SFX_SX126X_CS_PIN, GPIO_OUTPUT_PP );
	     gpio_reset(ITSDK_SFX_SX126X_CS_BANK,ITSDK_SFX_SX126X_CS_PIN);
		#elif ITSDK_SFX_SX126X_CSDN_PIN != __LP_GPIO_NONE
	     gpio_configure(ITSDK_SFX_SX126X_CSDN_BANK, ITSDK_SFX_SX126X_CSDN_PIN, GPIO_OUTPUT_PP );
		 gpio_set(ITSDK_SFX_SX126X_CSDN_BANK,ITSDK_SFX_SX126X_CSDN_PIN);
		#else
		  #warning "You did not setup a CS pin for SX1262 SPI, are you sure ?"
		#endif
	#endif

	// Configure the pin used for RFSwitch
	if ( ITSDK_SFX_SX126X_RFSW1_PIN != __LP_GPIO_NONE ) {
		gpio_configure_ext(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN,GPIO_OUTPUT_PP, ITSDK_GPIO_SPEED_HIGH, ITSDK_GPIO_ALT_NONE);
		gpio_reset(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN);
	}
	if ( ITSDK_SFX_SX126X_RFSW2_PIN != __LP_GPIO_NONE ) {
		gpio_configure_ext(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN,GPIO_OUTPUT_PP, ITSDK_GPIO_SPEED_HIGH, ITSDK_GPIO_ALT_NONE);
		gpio_reset(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN);
	}

	// Configure the pin used for TCXO an dpower on
	#if ITSDK_SFX_SX126X_TCXO_PIN != __LP_GPIO_NONE
		gpio_configure_ext(ITSDK_SFX_SX126X_TCXO_BANK,ITSDK_SFX_SX126X_TCXO_PIN,GPIO_OUTPUT_PP, ITSDK_GPIO_SPEED_HIGH, ITSDK_GPIO_ALT_NONE);
		gpio_set(ITSDK_SFX_SX126X_TCXO_BANK,ITSDK_SFX_SX126X_TCXO_PIN);
	#endif

	// Configure the interruption handler and SPI
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

		ITSDK_SFX_SX126X_SPI.Init.BaudratePrescaler = SUBGHZSPI_BAUDRATEPRESCALER_8;
		HAL_StatusTypeDef r = HAL_SUBGHZ_Init(&ITSDK_SFX_SX126X_SPI);
	    if (r != HAL_OK) {
		  #ifdef ERROR_CODES
	    	status = SX126X_HW_API_ERROR;
		  #endif
	      LOG_DEBUG_SFXSX126X(("[SX] Failed to init subghz %d\r\n",r));
	      RETURN();
	    }

		__HAL_RCC_SUBGHZSPI_CLK_ENABLE();
		HAL_NVIC_SetPriority(SUBGHZ_Radio_IRQn, 0, 0);
		HAL_NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);

	#else
		if ( ITSDK_SFX_SX126X_IRQ_PIN != __LP_GPIO_NONE ) {
			gpio_interruptClear(ITSDK_SFX_SX126X_IRQ_BANK, ITSDK_SFX_SX126X_IRQ_PIN);
			gpio_configure(ITSDK_SFX_SX126X_IRQ_BANK, ITSDK_SFX_SX126X_IRQ_PIN, GPIO_INTERRUPT_RISING );
			gpio_interruptPriority(ITSDK_SFX_SX126X_IRQ_BANK,ITSDK_SFX_SX126X_IRQ_PIN,0,0);
			gpio_registerIrqAction(&__sx1262_irq);
			gpio_interruptEnable(ITSDK_SFX_SX126X_IRQ_BANK, ITSDK_SFX_SX126X_IRQ_PIN);
		}
	#endif

	  // Clear the SX error register
	  sx126x_clear_device_errors(NULL);
	  #if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0
	  	  // Clear pending irq if
	  	  __sx126x_irq_status = __SX126X_IRQ_CLEARED;
	  #endif

    return status;
}

// ----------------------------------------------------------------------
// This function is called to reconfigure the board after a wake-up event
// The context parameter is SFX_NULL
// ----------------------------------------------------------------------
sx126x_hal_status_t sx126x_hal_wakeup( const void* context )
{
	SFX_UNUSED(context);
    LOG_DEBUG_SFXSX126X(("[SX] sx126x_hal_wakeup\r\n"));
    return SX126X_HAL_STATUS_OK;
}

// ----------------------------------------------------------------------
// Transfer the data to the SPI driver
// Context is unused, make a SPI transfer of the command
// Send a byte stream composed by command & data field on the SPI
// ----------------------------------------------------------------------
sx126x_hal_status_t sx126x_hal_write( const void* context, const uint8_t* command, const uint16_t command_length,
                                      const uint8_t* data, const uint16_t data_length )
{
	SFX_UNUSED(context);
    LOG_DEBUG_SFXSX126X(("[SX] sx126x_hal_write %d %d\r\n",command_length,data_length));

    #if (ITSDK_LOGGER_MODULE & __LOG_MOD_LOWSIGFOX) > 0
    	LOG_DEBUG_SFXSX126X(("[SX]  cmd: "));
		for ( int i = 0 ; i < command_length ; i++ ) {
			LOG_DEBUG_SFXSX126X(("%02X ",command[i]));
		}
		LOG_DEBUG_SFXSX126X(("\r\n"));
    	LOG_DEBUG_SFXSX126X(("[SX]  data: "));
		for ( int i = 0 ; i < data_length ; i++ ) {
			LOG_DEBUG_SFXSX126X(("%02X ",data[i]));
		}
		LOG_DEBUG_SFXSX126X(("\r\n"));
	#endif

	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

		(void)SUBGHZ_CheckDeviceReady(&ITSDK_SFX_SX126X_SPI);
		LL_PWR_SelectSUBGHZSPI_NSS();

		_SPI_Status r = __SPI_OK;
		for ( int i = 0 ; i < command_length && r == __SPI_OK; i++) {
			r =	(_SPI_Status)SUBGHZSPI_Transmit(&ITSDK_SFX_SX126X_SPI, command[i]);
		}
		if ( r != __SPI_OK ) goto failed;

