disk91/stm32-it-sdk/Src/drivers/sigfox/sx126x_hal.c
		for ( int i = 0 ; i < data_length && r == __SPI_OK; i++) {
			r =	(_SPI_Status)SUBGHZSPI_Transmit(&ITSDK_SFX_SX126X_SPI, data[i]);
		}
		if ( r != __SPI_OK ) goto failed;
		LL_PWR_UnselectSUBGHZSPI_NSS();
		SUBGHZ_WaitOnBusy(&ITSDK_SFX_SX126X_SPI);

	#else
		#warning "Use of standard SPI driver, never been tested"

		__sx126x_spi_nss_select();
		_SPI_Status r = __SPI_OK;
		for ( int i = 0 ; i < command_length && r == __SPI_OK; i++) {
			r = spi_write_byte(ITSDK_SFX_SX126X_SPI, command[i]);
		}
		if ( r != __SPI_OK ) goto failed;

		for ( int i = 0 ; i < data_length && r == __SPI_OK; i++) {
			r =	spi_write_byte(ITSDK_SFX_SX126X_SPI, data[i]);
		}
		if ( r != __SPI_OK ) goto failed;
		__sx126x_spi_nss_unselect();

	#endif


    return SX126X_HAL_STATUS_OK;

failed:
	LOG_ERROR_SFXSX126X(("[SX] sx126x_hal_write - failed %d\r\n",r));
	return SX126X_HAL_STATUS_ERROR;
}

// ----------------------------------------------------------------------
// Read the data from the SPI driver
// Context is unused, make a SPI transfer of the command
// Send a byte stream composed by command & data field on the SPI
// The command sent by the upper layer contains the NOP instruction when required
// ----------------------------------------------------------------------
sx126x_hal_status_t sx126x_hal_read( const void* context, const uint8_t* command, const uint16_t command_length,
                                     uint8_t* data, const uint16_t data_length )

{
	SFX_UNUSED(context);
    LOG_DEBUG_SFXSX126X(("[SX] sx126x_hal_read %d %d\r\n",command_length,data_length));
    LOG_DEBUG_SFXSX126X(("[SX] cmd[0] 0x%02X adr 0x%02X%02X\r\n",command[0],command[1],command[2]));

	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

		(void)SUBGHZ_CheckDeviceReady(&ITSDK_SFX_SX126X_SPI);
		LL_PWR_SelectSUBGHZSPI_NSS();

		_SPI_Status r = __SPI_OK;
		for ( int i = 0 ; i < command_length && r == __SPI_OK; i++) {
			r =	(_SPI_Status)SUBGHZSPI_Transmit(&ITSDK_SFX_SX126X_SPI, command[i]);
		}
		if ( r != __SPI_OK ) goto failed;

		// Read data
		for ( int i = 0 ; i < data_length && r == __SPI_OK; i++) {
			r =	(_SPI_Status)SUBGHZSPI_Receive(&ITSDK_SFX_SX126X_SPI, &data[i]);
		}

		#if (ITSDK_LOGGER_MODULE & __LOG_MOD_LOWSIGFOX) > 0
			LOG_DEBUG_SFXSX126X(("[SX] resp : "));
			for ( int i = 0 ; i < data_length && r == __SPI_OK ; i++) {
				LOG_DEBUG_SFXSX126X(("%02X ",data[i]));
			}
			LOG_DEBUG_SFXSX126X(("\r\n"));
		#endif

		if ( r != __SPI_OK ) goto failed;

		LL_PWR_UnselectSUBGHZSPI_NSS();
		SUBGHZ_WaitOnBusy(&ITSDK_SFX_SX126X_SPI);

	#else
		#warning "Use of standard SPI driver, never been tested"

		__sx126x_spi_nss_select();
		_SPI_Status r = __SPI_OK;
		for ( int i = 0 ; i < command_length && r == __SPI_OK; i++) {
			r = spi_write_byte(ITSDK_SFX_SX126X_SPI, command[i]);
		}
		if ( r != __SPI_OK ) goto failed;
		// Transmit dummy byte
		r = spi_write_byte(ITSDK_SFX_SX126X_SPI, 0U);
		if ( r != __SPI_OK ) goto failed;

		for ( int i = 0 ; i < data_length && r == __SPI_OK; i++) {
			r =	spi_read_byte(ITSDK_SFX_SX126X_SPI, &data[i]);
		}
		if ( r != __SPI_OK ) goto failed;
		__sx126x_spi_nss_unselect();

	#endif

    return SX126X_HAL_STATUS_OK;

failed:
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0
		LL_PWR_UnselectSUBGHZSPI_NSS();
	#else
		__sx126x_spi_nss_unselect();
	#endif
	LOG_ERROR_SFXSX126X(("[SX] sx126x_hal_read - failed %d\r\n",r));
	return SX126X_HAL_STATUS_ERROR;

}


// ============================================================
// sx126x_hal.c
// ============================================================



// ============================================================
// Call when sigfox lib is initialized
// Once on lib setup ; hardware init prefered on hal_reset call
// on every frame.
// ============================================================
SX126X_HW_API_status_t SX126X_HW_API_open(SX126X_HW_irq_cb_t callback)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_open\r\n"));

	#ifdef ERROR_CODES
	 SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif

	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0
	    __sx1262_irq_cb = callback;
	#else
		__sx1262_irq.irq_func = callback;
		__sx1262_irq.pinMask = ITSDK_SFX_SX126X_IRQ_PIN;
	#endif

	// nothing bad calling hardware config before the first sigfox send
	sx126x_hal_reset(NULL);

    RETURN();
}

SX126X_HW_API_status_t SX126X_HW_API_close(void)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_close\r\n"));

	// Switch off what we can ...

	// Reduce SMPSEN to 20mA
	uint8_t value;
	HAL_SUBGHZ_ReadRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_SMPSC2R,(uint8_t*)&value);
	value = (value & (~__SX126X_SMPS_DRV_MASK)) | __SX126X_SMPS_DRV_20;
	HAL_SUBGHZ_WriteRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_SMPSC2R,value);


	// Unset the pin for Chip Select
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) == 0
		#if ITSDK_SFX_SX126X_CS_PIN != __LP_GPIO_NONE
	     gpio_configure(ITSDK_SFX_SX126X_CS_BANK, ITSDK_SFX_SX126X_CS_PIN, GPIO_OFF );
		#elif ITSDK_SFX_SX126X_CSDN_PIN != __LP_GPIO_NONE
	     gpio_configure(ITSDK_SFX_SX126X_CSDN_BANK, ITSDK_SFX_SX126X_CSDN_PIN, GPIO_OFF );
		#else
		  #warning "You did not setup a CS pin for SX1262 SPI, are you sure ?"
		#endif
	#endif

	// Unset pin used for RFSwitch
	if ( ITSDK_SFX_SX126X_RFSW1_PIN != __LP_GPIO_NONE ) gpio_reset(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN);
	if ( ITSDK_SFX_SX126X_RFSW2_PIN != __LP_GPIO_NONE ) gpio_reset(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN);
	if ( ITSDK_SFX_SX126X_RFSW1_PIN != __LP_GPIO_NONE ) gpio_configure(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN,GPIO_OFF);
	if ( ITSDK_SFX_SX126X_RFSW2_PIN != __LP_GPIO_NONE ) gpio_configure(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN,GPIO_OFF);

	// disable interrupt
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

		__HAL_RCC_SUBGHZSPI_CLK_DISABLE();
		HAL_NVIC_DisableIRQ(SUBGHZ_Radio_IRQn);

	#else
		if ( ITSDK_SFX_SX126X_IRQ_PIN != __LP_GPIO_NONE ) {
			gpio_interruptClear(ITSDK_SFX_SX126X_IRQ_BANK, ITSDK_SFX_SX126X_IRQ_PIN);
			gpio_configure(ITSDK_SFX_SX126X_IRQ_BANK, ITSDK_SFX_SX126X_IRQ_PIN, GPIO_STOP );
			gpio_removeIrqAction(&__sx1262_irq);
		}
	#endif

	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif

    RETURN();
}

// ------------------------------------------------------------------
// Wait for the given number of ms
// ------------------------------------------------------------------
SX126X_HW_API_status_t SX126X_HW_API_delayMs(unsigned short delay_ms)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_delayMs\r\n"));
	itsdk_delayMs(delay_ms);

	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif

    RETURN();
}

// ------------------------------------------------------------------
// Return the type of semtech module used between 1261 and 1262
// ------------------------------------------------------------------
SX126X_HW_API_status_t SX126X_HW_API_get_chip_name(SX126X_HW_API_chip_name_t *chipset)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_chip_name\r\n"));
	#if ITSDK_SFX_SX126X_CHIP == __SX1261
	 *chipset = SX126X_HW_API_CHIP_NAME_SX1261;
	#elif ITSDK_SFX_SX126X_CHIP == __SX1262 || ITSDK_SFX_SX126X_CHIP == __E5WL
	 *chipset = SX126X_HW_API_CHIP_NAME_SX1262;
	#else
	 #error "You must select the Semtech core chip version in config file"
	#endif

	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}

// ------------------------------------------------------------------
// Return the type of power regulator used DCDC vs LDO
// ------------------------------------------------------------------
SX126X_HW_API_status_t SX126X_HW_API_get_reg_mode(SX126X_HW_API_reg_mod_t *reg_mode)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_reg_mode\r\n"));

