disk91/stm32-it-sdk/Src/drivers/sigfox/sx126x_hal.c
	#if ITSDK_SFX_SX1262_REGULOR == __POWER_LDO
	 *reg_mode = SX126X_HW_API_REG_MODE_LDO;
	#elif ITSDK_SFX_SX1262_REGULOR == __POWER_DCDC
	 *reg_mode = SX126X_HW_API_REG_MODE_DCDC;
	#else
	 #error "You must select the power regulator type in config file"
	#endif


	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}


// ------------------------------------------------------------------
// Return the oscillator configuration
// TCXO powered can be controlled by the SX126x DIO3 pin, in this case,
//  the tcxo_is_radio_controlled is set to 1 else 0. When controlled by
//  sx126x the power voltage can be set with supply_voltage, else this
//  voltage is ignored.
//  The startup_time_in_tick also only used when TCXO controlled by SX126x
// ------------------------------------------------------------------
SX126X_HW_API_status_t SX126X_HW_API_get_xosc_cfg(SX126X_HW_API_xosc_cfg_t *xosc_cfg)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_xosc_cfg\r\n"));
	#if !defined ITSDK_SFX_SX126X_TCXO_STIKS || !defined ITSDK_SFX_SX126X_TCXO_SXCTL
	  #error "The ITSDK_SFX_SX126X_TCXO_STIKS must be defined"
	#endif

	xosc_cfg->startup_time_in_tick = ITSDK_SFX_SX126X_TCXO_STIKS;
	#if ITSDK_SFX_SX126X_TCXO_SXCTL == __DISABLE
	 xosc_cfg->tcxo_is_radio_controlled = 0;
	#else
	 xosc_cfg->tcxo_is_radio_controlled = 1;
	#endif

	#if ITSDK_SFX_SX126X_TCXO_PWR == 16
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_1_6V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 17
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_1_7V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 18
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_1_8V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 22
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_2_2V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 24
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_2_4V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 27
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_2_7V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 30
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_3_0V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 33
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_3_3V;
	#else
		#error "The ITSDK_SFX_SX126X_TCXO_PWR must be defined"
	#endif

	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif

    RETURN();
}

// -----------------------------------------------------------------
// Configure the Rf Switch and the powering based on the
// configuration required
// the way PA is configured can be board specific, so it is
// possible to override this function for specific modules / implementation
// paSelected: __SX1262_PA_LP / __SX126X_PA_HP
// rxTx: __SX126X_RXTX_OFF, __SX126X_RX, __SX126X_TX
// -----------------------------------------------------------------
__weak void _sx126x_rfSwitchSet(uint8_t paSelected, uint8_t rxTx) {

	LOG_DEBUG_SFXSX126X(("[SX] _sx126x_rfSwitchSet (%d) (%d)\r\n",paSelected,rxTx));
	if ( ( rxTx & __SX126X_TX ) > 0 ) {
		// we are in transmission mode
		if ( paSelected == __SX126X_PA_LP ) {
		  #if ITSDK_SFX_SX1262_REGULOR  == __POWER_DCDC
			// Optimize power source (SMPS)
			uint8_t value;
			HAL_SUBGHZ_ReadRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_SMPSC2R,(uint8_t*)&value);
			value = (value & (~__SX126X_SMPS_DRV_MASK)) | __SX126X_SMPS_DRV_60;
			HAL_SUBGHZ_WriteRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_SMPSC2R,value);
		  #endif
		}
	}
	#if ITSDK_SFX_SX126X_MODULE == __SX126X_MOD_LORAE5 || ITSDK_SFX_SX126X_MODULE == __SX126X_MOD_RAK3172

		if( rxTx == __SX126X_RXTX_OFF ) {
			// Radio Off
			gpio_reset(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN);
			gpio_reset(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN);
		} else if ( rxTx == __SX126X_RX ) {
			// Rx mode
			gpio_set(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN);
			gpio_reset(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN);
		} else if ( rxTx == __SX126X_TX ) {
			if ( paSelected == __SX126X_PA_LP ) {
				// Low Power
				gpio_set(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN);
				gpio_set(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN);
			} else if ( paSelected == __SX126X_PA_HP ) {
				// High Power
				gpio_reset(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN);
				gpio_set(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN);
			} else {
				// invalid situation where tx & rx are on
				LOG_ERROR_SFXSX126X(("[SX] _sx126x_rfSwitchSet - LP & HP on or off %d\r\n",paSelected));
			}
		} else {
			// invalid situation where tx & rx are on
			LOG_ERROR_SFXSX126X(("[SX] _sx126x_rfSwitchSet - Tx & Rx on\r\n"));
		}

	#else
	  #warning "The _sx126x_rfSwitchSet is not configured for your board, select a board or override the function"
	#endif

}

// ------------------------------------------------------------------
// Power Amplifier configuration
//  This is corresponding to the SetPaConfig SPI Transaction chap 13.1.14 in SX1261-2 Datasheet V2.1
// - device_sel - select between sx1261 value 1 or sx1262 value 0
// - hp_max - for sx1262 only, to limit the power 2 = +14dBm, 3 = +17dBm, 5 = +20dBm, 7 = +22dBm
//            for sx1261 use 0
// - pa_duty_cycle - impact power distribution in the harmonics
//                   sx1262 recommended values for hp_max 0x04 for +22dBm, 0x03 for +20dBm, 0x02 for +17dBm and +14dBm
//                   sx1261 recommended values 0x06 for +15dBm, 0x04 for +14dBm, 0x01 for +10dBm
//                   if Freq > 400 MHz max 0x07 for sx1261 / if Freq < 400MHz max 0x07 for sx1261
//                   max value 0x04 for sx1262
// - pa_lut - always 1, reserved
// - power - if related to the setTxParam transaction chap 13.4.4 in SX1261-2 Datasheet V2.1
//		set the output power between -17 to +14dBm for low power PA and -9 to +22dBm for high power
// ------------------------------------------------------------------
static uint8_t __sx126x_lastTxConfig = __SX126X_PA_NONE;	// store last PA for RF switch
SX126X_HW_API_status_t SX126X_HW_API_get_pa_pwr_cfg(SX126X_HW_API_pa_pwr_cfg_t *pa_pwr_cfg, sfx_u32 rf_freq_in_hz, sfx_s8 expected_output_pwr_in_dbm)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_pa_pwr_cfg\r\n"));

	// add power base in setup for some adjustment eventually
	expected_output_pwr_in_dbm += ITSDK_RADIO_POWER_OFFSET;
	if ( expected_output_pwr_in_dbm > ITSDK_RADIO_MAX_OUTPUT_DBM ) {
		expected_output_pwr_in_dbm = ITSDK_RADIO_MAX_OUTPUT_DBM;
	}

	#if ITSDK_SFX_SX126X_CHIP == __E5WL
	    uint8_t pa = __SX126X_PA_LP;
		if ( ITSDK_SFX_SX126X_PA_SELECT ==  __SX126X_PA_LPHP ) {
			if ( expected_output_pwr_in_dbm  > 15 ) pa = __SX126X_PA_HP;
		} else if ( ITSDK_SFX_SX126X_PA_SELECT ==  __SX126X_PA_HP ) pa = __SX126X_PA_HP;


		// This can be optimized in terms of power settings see page 185 of user manual
		// Set_PaConfig() command
		__sx126x_lastTxConfig = pa;
		if ( pa == __SX126X_PA_LP ) {
			// Low Power PA
			if ( expected_output_pwr_in_dbm == 15 ) {
				 pa_pwr_cfg->pa_config.pa_duty_cycle = 7;
				 pa_pwr_cfg->pa_config.hp_max = 0;
				 pa_pwr_cfg->pa_config.device_sel = 1;
			} else {
				 pa_pwr_cfg->pa_config.pa_duty_cycle = 4;
				 pa_pwr_cfg->pa_config.hp_max = 0;
				 pa_pwr_cfg->pa_config.device_sel = 1;
			}
			if ( expected_output_pwr_in_dbm > 14 ) expected_output_pwr_in_dbm = 14;
			if ( expected_output_pwr_in_dbm < -17 ) expected_output_pwr_in_dbm = -17;

			uint8_t value = 0x18;
			HAL_SUBGHZ_WriteRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_OCP,value); // current max 60mA for the whole device
		} else {
			// High Power PA
			uint8_t value;
			HAL_SUBGHZ_ReadRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_TX_CLAMP,(uint8_t*)&value);
			value |= ( 0x0F << 1 );
			HAL_SUBGHZ_WriteRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_TX_CLAMP,value); // Better Resistance of the SX1262 Tx to Antenna Mismatch see chap 15.2

			if ( expected_output_pwr_in_dbm > 22 ) expected_output_pwr_in_dbm = 22;
			if ( expected_output_pwr_in_dbm < -9 ) expected_output_pwr_in_dbm = -9;

			if ( expected_output_pwr_in_dbm == 14 ) {
				// optimal params
				pa_pwr_cfg->pa_config.pa_duty_cycle = 2;
				pa_pwr_cfg->pa_config.hp_max = 2;
				pa_pwr_cfg->pa_config.device_sel = 0;
				expected_output_pwr_in_dbm = 0x16;
			} else if ( expected_output_pwr_in_dbm == 17 ) {
				// optimal params
				pa_pwr_cfg->pa_config.pa_duty_cycle = 2;
				pa_pwr_cfg->pa_config.hp_max = 3;
				pa_pwr_cfg->pa_config.device_sel = 0;
				expected_output_pwr_in_dbm = 0x16;
			} else if ( expected_output_pwr_in_dbm == 20 ) {
				// optimal params
				pa_pwr_cfg->pa_config.pa_duty_cycle = 3;
				pa_pwr_cfg->pa_config.hp_max = 5;
				pa_pwr_cfg->pa_config.device_sel = 0;
				expected_output_pwr_in_dbm = 0x16;
			} else {
				// keep it standard for the rest (optimal of 22dBm)
				pa_pwr_cfg->pa_config.pa_duty_cycle = 4;
				pa_pwr_cfg->pa_config.hp_max = 7;
				pa_pwr_cfg->pa_config.device_sel = 0;
			}

			value = 0x38;
			HAL_SUBGHZ_WriteRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_OCP,value); // current max 140mA for the whole device
		}
	#elif ITSDK_SFX_SX126X_CHIP == __SX1261
		pa_pwr_cfg->pa_config.device_sel = 1;
		if ( expected_output_pwr_in_dbm  <= 10 ) {
			pa_pwr_cfg->pa_config.pa_duty_cycle = 1;
			pa_pwr_cfg->pa_config.hp_max = 0;
		} else if ( expected_output_pwr_in_dbm <= 14 ) {
			pa_pwr_cfg->pa_config.pa_duty_cycle = 4;
			pa_pwr_cfg->pa_config.hp_max = 0;
		} else if ( expected_output_pwr_in_dbm <= 15 ) {
			pa_pwr_cfg->pa_config.pa_duty_cycle = 6;
			pa_pwr_cfg->pa_config.hp_max = 0;
		} else {
			LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_pa_pwr_cfg pwr is too high !\r\n"));
		}
		#if ITSDK_RADIO_MAX_OUTPUT_DBM > 15
		 #error "ITSDK_SFX_SX126X_MAX_PWR is out of range"
		#endif
	#elif ITSDK_SFX_SX126X_CHIP == __SX1262
		pa_pwr_cfg->pa_config.device_sel = 0;
		if ( expected_output_pwr_in_dbm  <= 14 ) {
			pa_pwr_cfg->pa_config.pa_duty_cycle = 2;
 		 	 pa_pwr_cfg->pa_config.hp_max = 2;
		} else if ( expected_output_pwr_in_dbm <= 17 ) {
			pa_pwr_cfg->pa_config.pa_duty_cycle = 2;
 		 	 pa_pwr_cfg->pa_config.hp_max = 3;
		} else if ( expected_output_pwr_in_dbm <= 20 ) {
			pa_pwr_cfg->pa_config.pa_duty_cycle = 3;
 		 	 pa_pwr_cfg->pa_config.hp_max = 5;
		} else if ( expected_output_pwr_in_dbm <= 22 ) {
			pa_pwr_cfg->pa_config.pa_duty_cycle = 4;
 		 	 pa_pwr_cfg->pa_config.hp_max = 7;
		} else {
			LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_pa_pwr_cfg pwr is too high !\r\n"));
		}
		#if ITSDK_RADIO_MAX_OUTPUT_DBM > 12
		 #warning "ITSDK_RADIO_MAX_OUTPUT_DBM is out of range"
		#endif
	#else
		#error "You must define ITSDK_SFX_SX126X_CHIP with a valid value"
	#endif

	#if	ITSDK_SFX_SX126X_PA_DC_OVR != __AVOID
		pa_pwr_cfg->pa_config.pa_duty_cycle = ITSDK_SFX_SX126X_PA_DC_OVR
	#endif
	#if	ITSDK_SFX_SX126X_PA_HPM_OVR != __AVOID
		pa_pwr_cfg->pa_config.hp_max = ITSDK_SFX_SX126X_PA_HPM_OVR
	#endif

	// Make sure the pa_duty_cycle doesn't exceed the max accepted value (cf Chap 13.1.14)
	#if ITSDK_SFX_SX126X_CHIP == __SX1261
		if ( rf_freq_in_hz >= 400000000 && pa_pwr_cfg->pa_config.pa_duty_cycle > 7 ) pa_pwr_cfg->pa_config.pa_duty_cycle = 7;
		if ( rf_freq_in_hz <= 400000000 && pa_pwr_cfg->pa_config.pa_duty_cycle > 4 ) pa_pwr_cfg->pa_config.pa_duty_cycle = 4;
	#elif ITSDK_SFX_SX126X_CHIP == __SX1262 || ITSDK_SFX_SX126X_CHIP == __E5WL
		if ( pa_pwr_cfg->pa_config.pa_duty_cycle > 4 ) pa_pwr_cfg->pa_config.pa_duty_cycle = 4;
	#endif

