disk91/stm32-it-sdk/Src/drivers/sigfox/sx126x_hal.c
	// reserved value
	pa_pwr_cfg->pa_config.pa_lut = 1;

	// power
	pa_pwr_cfg->power = expected_output_pwr_in_dbm;


	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}


// ------------------------------------------------------------------
// Radio switch configuration
// Set the Tx on, we need to use the right PA setting, it depends
// on the chip and the power amplifier configuration can be required
// ------------------------------------------------------------------
SX126X_HW_API_status_t SX126X_HW_API_tx_on(void)
{

	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_tx_on\r\n"));
	_sx126x_rfSwitchSet(__sx126x_lastTxConfig,__SX126X_TX);
	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}

SX126X_HW_API_status_t SX126X_HW_API_tx_off(void)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_tx_off\r\n"));
	_sx126x_rfSwitchSet(__sx126x_lastTxConfig,__SX126X_RXTX_OFF);
	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}

#ifdef BIDIRECTIONAL
SX126X_HW_API_status_t SX126X_HW_API_rx_on(void)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_rx_on\r\n"));
	_sx126x_rfSwitchSet(__sx126x_lastTxConfig,__SX126X_RX);
	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}
#endif

#ifdef BIDIRECTIONAL
SX126X_HW_API_status_t SX126X_HW_API_rx_off(void)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_rx_off\r\n"));
	_sx126x_rfSwitchSet(__sx126x_lastTxConfig,__SX126X_RXTX_OFF);
	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}
#endif


// ------------------------------------------------------------------
// LATENCY COMPENSATION
// ...
// ------------------------------------------------------------------

#if (defined TIMER_REQUIRED) && (defined LATENCY_COMPENSATION)
SX126X_HW_API_status_t SX126X_HW_API_get_latency(SX126X_HW_API_latency_t latency_type, sfx_u32 *latency_ms)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_latency\r\n"));
	switch ( latency_type ) {
	case SX126X_HW_API_LATENCY_RESET:
	case SX126X_HW_API_LATENCY_WAKEUP:
		*latency_ms = ITSDK_SFX_SX126X_LATENCYMS;
		break;
	default:
		 LOG_ERROR_SFXSX126X(("[SX] SX126X_HW_API_get_latency - Invalid type %d\r\n",latency_type));
		 break;
	}

	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}
#endif


#endif // ITSDK_WITH_SIGFOX_LIB == __ENABLE && ITSDK_SIGFOX_LIB == __SIGFOX_SX126X
